{
    "tablas": {
        "title": "Tablas",
        "description": "Spreadsheet program which is runned on the console.",
        "categories": ["C++", "Console", "Office"],
        "image": "tablas-img1.png",
        "content": "**Tablas is a console application made in C++ which is a spreadsheet like Excel but it's rendered on the console.**\n## History<hr> \nThe project started a long time ago, in 2024, with LaQTeOS, an OS made also in C++, needed more programs like code editors, text editors, etc... I coded Tablas as a alpha on that time. Then I finished the alpha on the same month and abandoned that project until a few months ago.\nI updated all the code making the program prettier, fixing bugs, adding features, making the code more undestandable and more readable, etc... It's closed-source but I'm thinking of making it open-source.\n## Features<hr>\n1. **Sheets**: One file can have different sheets, like tabs.\n2. **Formulas**: Although this features isn't complete, you can use formulas like `=CALC(2+2)` or `=GET(A1)` (those are the only formulas right now).\n3. **Images**: You can import images to a Tablas file and then add that image to a cell. When you press Enter in a cell with an image, a window us opened showing the image.\n4. **Files**: I have optimized the files that you can save in Tablas at 100%, the content is only the 100% necessary data for the file to work correctly.\n5. **Command mode**: Like Vim, if you press `:`, you enter a command mode which lets you do a lot of operations easily.\n6. **Macros**: Although this feature isn't complete at all, I'm thinking of adding something like Microsft's VBA to Tablas, and make some IDE inside Tablas to write Macros, compile them and run them.\n# Screenshots<hr>\n![Tablas screen at startup](../../images/tablas-img2.png)*This image shows what you see when you start Tablas*\n\n![Formulas in Tablas](../../images/tablas-img6.png)\n*This image shows how CALC formula works, you can see the result of the operation in the cell and on the top you can see the formula being used.*\n\n![New sheet dialog on Tablas](../../images/tablas-img7.png)\n*This dialog lets you insert a name for a new sheet or tab.*\n\n![Command mode of Tablas](../../images/tablas-img12.png)\n*This is how command mode looks in Tablas*\n\n![Import image dialog of Tablas](../../images/tablas-img9.png)\n*This dialog lets you import an image from your computer to the Tablas file*\n\n![Insert image dialog](../../images/tablas-img10.png)\n*This is the dialog for inserting an image on a cell*\n\n![Tablas' Image viewer](../../images/tablas-img11.png)\n*This is the Image Viewer.*\n\n![Print dialog](../../images/tablas-img3.png)\n*This is Tablas' print dialog, here you can select what to print.*\n\n![Print confirmation dialog](../../images/tablas-img4.png)\n*This is the print confirm dialog*\n\n![Output of print in PDF](../../images/tablas-img5.png)\n*This is the output of a file which was printed to PDF.*",
        "lang": "cpp"
    }
}